# IdeaStatiCa.RcsApi.Model.Vector3D
Represents a vector in three-dimensional space.

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**X** | **double** | Gets or sets the X-dirrection value | [optional]
**Y** | **double** | Gets or sets the Y-dirrection value | [optional]
**Z** | **double** | Gets or sets the Z-dirrection value | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)